<?php

use Illuminate\Database\Migrations\Migration;
use Illuminate\Database\Schema\Blueprint;
use Illuminate\Support\Facades\Schema;

class LegalAggrementsAddAlrajhiTc extends Migration
{
    /**
     * Run the migrations.
     *
     * @return void
     */
    public function up()
    {
        $terms = "الشروط الأحكام:
        أولا\ التعريفات: 
        العميل: ولي الأمر أو المستخدم لدى منصة ذا إيديوكي ومصرف الراجحي.
        عرض السعر: هو نموذج عرض سعر التمويل المعتمد من مصرف الراجحي للعميل والذي يقوم بإكماله بالنيابة عن العميل منصة ذا إيديوكي والمرفق صورته أدناه. 
        ثانيا\ نطاق غرض خدمات التمويل: 
        نطاق عمل هذه الخدمة حيث تتيح للمستخدم طلب تمويل من (مصرف الراجحي) وذلك بحد أدنى للتمويل (5) خمسة الاف ريال، على أن يكون دفع الرسوم الدراسية بشكل أقساط، حيث يسهل على أولياء الأمور اختيار وسيلة الدفع المناسبة لهم مع مراعاة أهلية الاستحقاق. 
        
        ثالثا\ شروط وآليه التمويل:
        
        1.	أن يكون لولي الأمر حسابً مضاف به أبنائه في منصة ذا إيدوكي. 
        2.	أن يكون ولي الأمر أحد عملاء مصرف الراجحي ويعمل في أحد الجهات المعتمدة لديهم وراتبه محول على البنك.
        3.	أن يتم اختيار المدرسة واختيار أيقونة (أشترك الان) اختيار المدرسة المطلوب تسجيل الأبناء بها وذلك عن طريق أيقونة \"أشترك الآن\"
        4.	في حال موافقة المدرسة على طلب الإشتراك المقدم من العميل, يلزم على العميل الدخول على ايقونة طلباتي والضغط على ايقونة الدفع ومن ثم إختيار طريقة الدفع التالية \"تمويل مصرف الراجحي\"
        5.	الموافقة على شروط وأحكام الخدمة التي ستظهر بعد اختيار طريقة الدفع.
        6.	يفوض العميل منصة ذا إيديوكي بتقديم عرض السعر لمصرف الراجحي بدلاً عنه.
        7.	على العميل تزويد مصرف الراجحي بالبيانات والمستندات في الفقرة خامساً. 
        
        رابعا\ البيانات والمستندات المطلوبة لتزويدها لمقدم خدمة طلب التمويل (مصرف الراجحي): 
        1.	الهوية
        2.	خطاب تعريف بالراتب والتثبيت.
        3.	برنت التأمينات.
        4.	عرض السعر، سيتم تعبئته وإرساله من قبل منصة ذا إيديو كي بالنيابة عن العميل
        
        خامسه\ إقرارات والتزامات المستخدم \المتقدم بطلب تمويل 
        1.	أقر بمعرفتي ودرايتي ومسؤوليتي الكاملة عن البيانات والمستندات المقدمة مني لمنصة ذا إيديوكي ومصرف الراجحي.
        2.	أقر والتزم بأني عميل مصرف الراجحي وأن الراتب الشهري يتم تحويله للمصرف, عدا ذلك فلمنصة ذا إيديوكي الحق في فرض غرامة على قدرها 2.5% من قيمة رسوم التسجيل \"كرسوم إدارية\" لمنصة ذا إيديوكي مقابل تقديمي طلب غير صحيح.
        3.	أقر والتزم بقبول عرض السعر وبسداد الدفعات المستحقة شهريا.
        4.	أقر والتزم أنه في حال رغبتي في فسخ العقد أن يكون خلال الاجل المحدد من البنك المركزي وستتم التسوية بيني وبين مصرف الراجحي، وأن أتحمل أي رسوم وأتعاب مقابل الخدمة. 
        5.	أقر والتزم بأن يكون ذا إيديوكي هو المستقبل لمبلغ التمويل / الرسوم الدراسية من مصرف الراجحي، وأخوله بإيداعها في حساب المدرسة بالنيابة عني. 
        6.	أقر والتزم بعدم مطالبة ذا إيدوكي بأي تعويض مالي بعد إيداع ذا إيديوكي مبلغ الرسوم الدراسية في حساب المدرسة نتج عنها ضرر في الخدمة من قبل مزود الخدمة.
        7.	أقر والتزم بأن مسؤولية ذا إيديوكي تتوقف بعد تحويل مبلغ الرسوم الدراسية المستلم من مصرف الراجحي إلى المدرسة. 
        8.	أقر والتزم بأن الغرض من هذا التمويل هو فقط لسداد الرسوم الدراسية الموضحة في عرض السعر. 
        9.	أقر والتزم بمعرفتي التامة بأن مصرف الراجحي هو من سيقوم بتحويل مبلغ التمويل / الرسوم الدراسية إلى الحساب البنكي لمنصة ذا إيديوكي, وعليه ستقوم المنصة بتحويل مبلغ التمويل /الرسوم الدراسية إلى حساب المدرسة. 
        10.	أقر والتزم بأن عرض السعر موافق عليه وأفوض المصرف بخصم قيمة رسوم التسجيل من الحساب الجاري الخاص بي على أقساط حسب الاتفاق. 
        ";
        Schema::table('legal_agreements', function (Blueprint $table) {
            $table->string('type')->default('general');
        });

        DB::table("legal_agreements")->insert([
            "text" => $terms,
            "text_en" => $terms,
            "type" => "alrajhi-installments"
        ]);
    }

    /**
     * Reverse the migrations.
     *
     * @return void
     */
    public function down()
    {
        Schema::table('legal_agreements', function (Blueprint $table) {
            $table->dropColumn('type');
        });
    }
}
